#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Float2.h"
#include "Hit.h"

// 弾の変数
Float2 bullet_pos;			// 発射する弾の座標
float bullet_r;				// 弾の半径

Float2 bullet_mov;			// 弾の移動量

Float2 mouse;				// マウス座標を入れる用変数

bool mouse_drag;			// マウスがドラッグ中かどうか

Float2 click_pos;			// クリックした瞬間の変数

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	bullet_pos.x = SCREEN_W /  2.0f;
	bullet_pos.y = SCREEN_H - 50.0f;
	bullet_r = 10.0f;
}

//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	// マウス座標の取得(引っ張る用)
	mouse.x = (float)GetMouseX();
	mouse.Y = (float)GetMouseY();
}

//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	DrawCircle(bullet_pos.x, bullet_pos.y, bullet_r, GetColor( 0, 255, 255), FALSE);
}

//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
	
}
